testCases/02_solid_body_movement/01_body_with_prescribed_rotation/Allrun
#!/bin/sh
. $WM_PROJECT_DIR/bin/tools/RunFunctions

rm -rf 0

cp -r 0.org 0

paraFoam -touch
paraFoam -builtin -touch

runApplication blockMesh

application=`getApplication`

runApplication $application


# ----------------------------------------------------------------- end-of-file
